IdeaRS.OpenModel.Loading.LoadOnLine
Load on line
This sample shows how to create a load on the line.
//Creating the model
OpenModel openModel = new OpenModel();
//Create nodes
Point3D pointA = new Point3D();
pointA.X = 0;
pointA.Y = 0;
pointA.Z = 0;
openModel.AddObject(pointA);
Point3D pointB = new Point3D();
pointB.X = 0;
pointB.Y = 0;
pointB.Z = 1.2;
openModel.AddObject(pointB);
Point3D pointC = new Point3D();
pointC.X = 0;
pointC.Y = 0;
pointC.Z = 2.4;
openModel.AddObject(pointC);
//Line between nodes
LineSegment3D line1 = new LineSegment3D();
line1.StartPoint = new ReferenceElement(pointA);
line1.EndPoint = new ReferenceElement(pointB);
//LCS of line
line1.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line1);
//Line between nodes
LineSegment3D line2 = new LineSegment3D();
line2.StartPoint = new ReferenceElement(pointB);
line2.EndPoint = new ReferenceElement(pointC);
//LCS of line
line2.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line2);
//Load case
LoadCase loadCase = new LoadCase();
//...
openModel.AddObject(loadCase);
//Uniform load on line2 - relative between 0.1-0.6. In the LCS of line. -2kN in the z-direction
LoadOnLine loadLine = new LoadOnLine();
loadLine.Bimp = new LoadImpulse() { Z = -2e3 };
loadLine.Eimp = new LoadImpulse() { Z = -2e3 };
loadLine.Type = LoadType.LoadForce;
loadLine.Direction = LoadDirection.InLcs;
loadLine.Geometry = new ReferenceElement(line2);
loadLine.LoadProjection = LoadProjection.Length;
loadLine.RelativeBeginPosition = 0.1;
loadLine.RelativeBeginPosition = 0.6;
openModel.AddObject(loadLine);
loadCase.LoadsOnLine.Add(new ReferenceElement(loadLine));

IdeaRS.OpenModel.Loading.LoadOnLine.#ctor
Constructor

IdeaRS.OpenModel.Loading.LoadOnLine.RelativeBeginPosition
Begin position on Segment3D

IdeaRS.OpenModel.Loading.LoadOnLine.RelativeEndPosition
End position on Segment3D

IdeaRS.OpenModel.Loading.LoadOnLine.ExY
Eccentricity local Y on the beginning

IdeaRS.OpenModel.Loading.LoadOnLine.ExZ
Eccentricity local Z on the beginning

IdeaRS.OpenModel.Loading.LoadOnLine.ExYEnd
Eccentricity local Y at the end

IdeaRS.OpenModel.Loading.LoadOnLine.ExZEnd
Eccentricity local Z at the end

IdeaRS.OpenModel.Loading.LoadOnLine.Type
Type of load

IdeaRS.OpenModel.Loading.LoadOnLine.Direction
1=global, 0=local

IdeaRS.OpenModel.Loading.LoadOnLine.Bimp
Impulse at the begin

IdeaRS.OpenModel.Loading.LoadOnLine.Eimp
Impulse at the end

IdeaRS.OpenModel.Loading.LoadOnLine.Geometry
Segment3D or PolyLine3D

IdeaRS.OpenModel.Loading.LoadOnLine.LoadProjection
Gets, sets load projection